#include "TRleConstans.h"
#include "URPolyLine.h"


//Xв_XT=80_p7_41
// график изменения продольной балансировки (ход цикл шага тангажа) в горизонтальном полете без скольжения
// центровка XT = 80 мм


int NumParts = 1;

int NumPoints_XB_XT80_p7_41 = 9;

double Points_XB_XT80_p7_41[] = {
        81.143798 , 54.545498
        , 102.936738 , 54.545498
        , 129.830046 , 57.754095
        , 159.505428 , 63.101654
        , 185.007700 , 71.123011
        , 214.683214 , 82.352964
        , 242.040168 , 95.721918
        , 269.860901 , 110.695228
        , 290.726417 , 124.598904
};

int Parts_XB_XT80_p7_41 [] = {0};

extern TURPolyLine Pln_XB_XT80_p7_41(NumParts,NumPoints_XB_XT80_p7_41,Parts_XB_XT80_p7_41
                                 ,Points_XB_XT80_p7_41);

//


//------------------------------------------------------------------------------------------
// график изменения продольной балансировки (ход цикл шага тангажа) в горизонтальном полете без скольжения
// центровка XT = 40 мм
// по оси X км/ч по оси Y мм
// максимум 200 мм

int NumPoints_XB_XT40_p7_41 =8;

double Points_XB_XT40_p7_41[] = {
81.225369 , 63.746561
, 99.656579 , 64.949768
, 111.480374 , 67.356184
, 134.084689 , 71.366876
, 161.905384 , 79.388261
, 213.721429 , 96.233168
, 243.280918 , 107.864176
, 289.532823 , 129.521915
};

extern TURPolyLine Pln_XB_XT40_p7_41(NumParts,NumPoints_XB_XT40_p7_41,Parts_XB_XT80_p7_41
                                 ,Points_XB_XT40_p7_41);

//----------------------------------------------------------------------------------------
// график изменения продольной балансировки (ход цикл шага тангажа) в горизонтальном полете без скольжения
// центровка XT = 125 мм
// по оси X км/ч по оси Y мм
// максимум 200 мм
int NumPoints_XB_XT125_p7_41 = 8;


double Points_XB_XT125_p7_41[] = {
78.443299 , 52.115553
, 111.480374 , 48.906999
, 135.823483 , 50.511276
, 168.165041 , 56.928384
, 199.115564 , 66.554045
, 230.066087 , 81.393607
, 258.930059 , 99.040653
, 278.404545 , 113.880215
};
extern TURPolyLine Pln_XB_XT125_p7_41(NumParts,NumPoints_XB_XT125_p7_41,Parts_XB_XT80_p7_41
                                 ,Points_XB_XT125_p7_41);
//----------------------------------------------------------------------------------------------

// график изменения угла тангажа в горизонтальном полете без скольжения
// центровка XT = 40 мм
// по оси X км/ч по оси Y мм

int NumPoints_NU_XT40_p7_41 = 7  ;
double Points_Nu_XT40_p7_41[] = {
85.297076 , 4.014675
, 121.519047 , 3.330846
, 156.864679 , 2.338190
, 196.299889 , 1.124944
, 227.263832 , 0.021993
, 271.372845 , -1.786847
, 289.775943 , -2.647149
};

extern TURPolyLine Pln_Nu_XT40_p7_41(NumParts, NumPoints_NU_XT40_p7_41,Parts_XB_XT80_p7_41
                                 ,Points_Nu_XT40_p7_41);
//-----------------------------------------------------------------------------------
// график изменения угла тангажа в горизонтальном полете без скольжения
// центровка XT = 80 мм
// по оси X км/ч по оси Y мм

int NumPoints_NU_XT80_p7_41 = 9  ;
double Points_Nu_XT80_p7_41[] = {
    80.915386 , 3.154374
    , 95.813132 , 2.911724
    , 121.519047 , 2.316131
    , 148.393412 , 1.588183
    , 180.233693 , 0.595527
    , 196.592002 , -0.000066
    , 241.285240 , -1.875083
    , 270.204394 , -3.242742
    , 289.483830 , -4.279516

};

extern TURPolyLine Pln_Nu_XT80_p7_41(NumParts, NumPoints_NU_XT80_p7_41,Parts_XB_XT80_p7_41
                                 ,Points_Nu_XT80_p7_41);
//-----------------------------------------------------------------------------------
// график изменения угла тангажа в горизонтальном полете без скольжения
// центровка XT = 125 мм
// по оси X км/ч по оси Y мм

int NumPoints_NU_XT125_p7_41 = 8  ;
double Points_Nu_XT125_p7_41[] = {
    80.623273 , 1.610242
    , 111.879329 , 1.147003
    , 144.888060 , 0.507291
    , 175.852003 , -0.286833
    , 205.939607 , -1.257430
    , 236.319325 , -2.448617
    , 263.777915 , -3.728041
    , 282.181013 , -4.698637

};

extern TURPolyLine Pln_Nu_XT125_p7_41(NumParts, NumPoints_NU_XT125_p7_41,Parts_XB_XT80_p7_41
                                 ,Points_Nu_XT125_p7_41);
//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------
// график изменения угла тангажа в горизонтальном полете без скольжения
// центровка XT = 80 мм график 7ю44
// по оси X км/ч по оси Y мм

int NumPoints_NU_XT80_p7_44 = 10  ;
double Points_Nu_XT80_p7_44[] = {
-0.267983 , 5.970000
, 13.502577 , 5.853512
, 20.187315 , 5.737025
, 32.086148 , 5.474929
, 40.375222 , 5.212833
, 57.488151 , 4.732324
, 60.295741 , 4.659520
, 75.804332 , 4.353741
, 83.692323 , 4.237254
, 100.404167 , 4.295497
} ;

extern TURPolyLine Pln_Nu_XT80_p7_44(NumParts, NumPoints_NU_XT80_p7_44,Parts_XB_XT80_p7_41
                                 ,Points_Nu_XT80_p7_44);

// График изменения поперечной балансировки  в зависимости от скортсти гориз. полета
// центровка = 80 мм

 int NumPoints_Xk_XT80_p7_43 = 8 ;

 double Points_Xk_XT80_p7_43[] = {
     81.830330 , 26.083957
     , 190.620849 , 25.828212
     , 203.942137 , 25.060977
     , 228.047325 , 24.805233
     , 246.760563 , 23.270763
     , 261.667719 , 23.270763
     , 278.160742 , 21.992038
     , 290.530509 , 21.736293
 };

 extern TURPolyLine Pln_Xk_XT80_p7_43(NumParts, NumPoints_Xk_XT80_p7_43,Parts_XB_XT80_p7_41
                                  ,Points_Xk_XT80_p7_43);
 ///
 // График изменения продольной  балансировки  в зависимости от скортсти гориз. полета
 // центровка = 80 мм
int NumPoints_XH_XT80_p7_43 = 7 ;
double Points_XH_XT80_p7_43[] = {
 90.999003 , 2.820316
 , 136.349241 , 1.413957
 , 168.379829 , 0.811232
 , 191.847785 , -0.193309
 , 231.172467 , -2.202393
 , 265.422996 , -3.809659
 , 281.596858 , -4.613292
};
extern TURPolyLine Pln_XH_XT80_p7_43(NumParts, NumPoints_XH_XT80_p7_43,Parts_XB_XT80_p7_41
                                 ,Points_XH_XT80_p7_43);

//График изменения угла крена в зависимости от бокового ветра стр 7-45

int NumPoints_Gamma_p7_45 =14;
double Points_Gamma_p7_45[] = {
-23.490463 , -5.811802
, -19.389569 , -5.854534
, -17.874021 , -5.769069
, -15.823574 , -5.427210
, -11.990130 , -4.572562
, -5.927940 , -2.265012
, -1.024697 , -0.042927
, 0.134251 , 0.512595
, 6.909641 , 3.503863
, 10.475636 , 4.828568
, 15.111428 , 6.281470
, 18.008799 , 6.879723
, 19.212322 , 7.007920
, 23.536091 , 6.965188
};

extern TURPolyLine Pln_Gamma_p7_45(NumParts, NumPoints_Gamma_p7_45,Parts_XB_XT80_p7_41
                                 ,Points_Gamma_p7_45);
//

TRleConstans::TRleConstans()
{

}
